---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageSeverity.FatalError
enum: Autodesk.Revit.DB.DataExchangeMessageSeverity
source: html/58faa4d4-5f07-500e-e6e4-477c4449a0cd.htm
---
# Autodesk.Revit.DB.DataExchangeMessageSeverity.FatalError

A serious problem that makes further data conversion pointless. The conversion process will be cancelled.